ITHACA-FV/tutorials/CFD/07NonIsothermalMixingElbow/0/Tlift1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tlift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
2200
(
-8.38806e-56
-1.20217e-54
-5.42736e-49
-2.43569e-55
-5.11223e-62
-6.27447e-69
-4.86424e-76
-2.47021e-83
...
)
;

boundaryField
{
    wall-4
    {
        type            zeroGradient;
    }
    pressure-outlet-7
    {
        type            zeroGradient;
    }
    velocity-inlet-6
    {
        type            fixedValue;
        value           uniform 1;
    }
    velocity-inlet-5
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
